Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="ADC Control Register 3" name="ADCCON3" offset="0x20" rw="RW" size="4">
            <bitfield caption="Analog Input Select bits" mask="0x0000003F" name="ADINSEL" values="ADCCON3__ADINSEL" />
            <bitfield caption="Global Software Trigger bit" mask="0x00000040" name="GSWTRG" values="ADCCON3__GSWTRG" />
            <bitfield caption="Global Level Software Trigger bit" mask="0x00000080" name="GLSWTRG" values="ADCCON3__GLSWTRG" />
            <bitfield caption="Individual ADC Input Conversion Request bit" mask="0x00000100" name="RQCNVRT" values="ADCCON3__RQCNVRT" />
            <bitfield caption="Shared ADC7 Analog Input Sampling Enable bit " mask="0x00000200" name="SAMP" values="ADCCON3__SAMP" />
            <bitfield caption="ADC Update Ready Status bit" mask="0x00000400" name="UPDRDY" values="ADCCON3__UPDRDY" />
            <bitfield caption="Update Ready Interrupt Enable bit" mask="0x00000800" name="UPDIEN" values="ADCCON3__UPDIEN" />
            <bitfield caption="Trigger Suspend bit" mask="0x00001000" name="TRGSUSP" values="ADCCON3__TRGSUSP" />
            <bitfield caption="Voltage Reference Input Selection bits" mask="0x0000E000" name="VREFSEL" values="ADCCON3__VREFSEL" />
            <bitfield caption="ADC0 Digital Enable bit" mask="0x00010000" name="DIGEN0" values="ADCCON3__DIGEN0" />
            <bitfield caption="ADC1 Digital Enable bit" mask="0x00020000" name="DIGEN1" values="ADCCON3__DIGEN1" />
            <bitfield caption="ADC2 Digital Enable bit" mask="0x00040000" name="DIGEN2" values="ADCCON3__DIGEN2" />
            <bitfield caption="ADC3 Digital Enable bit" mask="0x00080000" name="DIGEN3" values="ADCCON3__DIGEN3" />
            <bitfield caption="ADC4 Digital Enable bit" mask="0x00100000" name="DIGEN4" values="ADCCON3__DIGEN4" />
            <bitfield caption="ADC5 Digital Enable bit" mask="0x00200000" name="DIGEN5" values="ADCCON3__DIGEN5" />
            <bitfield caption="Shared ADC (ADC7) Digital Enable bit" mask="0x00800000" name="DIGEN7" values="ADCCON3__DIGEN7" />
            <bitfield caption="Analog-to-Digital Control Clock Divider bits" mask="0x3F000000" name="CONCLKDIV" values="ADCCON3__CONCLKDIV" />
            <bitfield caption="Analog-to-Digital Clock Source bits" mask="0xC0000000" name="ADCSEL" values="ADCCON3__ADCSEL" />
         </register>
         <register caption="ADC Triggering Mode for Dedicated ADC Register" name="ADCTRGMODE" offset="0x30" rw="RW" size="4">
            <bitfield caption="ADC0 Synchronous Sampling bit" mask="0x00000001" name="SSAMPEN0" values="ADCTRGMODE__SSAMPEN0" />
            <bitfield caption="ADC1 Synchronous Sampling bit" mask="0x00000002" name="SSAMPEN1" values="ADCTRGMODE__SSAMPEN1" />
            <bitfield caption="ADC2Synchronous Sampling bit" mask="0x00000004" name="SSAMPEN2" values="ADCTRGMODE__SSAMPEN2" />
            <bitfield caption="ADC3 Synchronous Sampling bit" mask="0x00000008" name="SSAMPEN3" values="ADCTRGMODE__SSAMPEN3" />
            <bitfield caption="ADC4 Synchronous Sampling bit" mask="0x00000010" name="SSAMPEN4" values="ADCTRGMODE__SSAMPEN4" />
            <bitfield caption="ADC5 Synchronous Sampling bit" mask="0x00000020" name="SSAMPEN5" values="ADCTRGMODE__SSAMPEN5" />
            <bitfield caption="ADC0 Presynchronized Triggers bit" mask="0x00000100" name="STRGEN0" values="ADCTRGMODE__STRGEN0" />
            <bitfield caption="ADC1 Presynchronized Triggers bit" mask="0x00000200" name="STRGEN1" values="ADCTRGMODE__STRGEN1" />
            <bitfield caption="ADC2 Presynchronized Triggers bit" mask="0x00000400" name="STRGEN2" values="ADCTRGMODE__STRGEN2" />
            <bitfield caption="ADC3 Presynchronized Triggers bit" mask="0x00000800" name="STRGEN3" values="ADCTRGMODE__STRGEN3" />
            <bitfield caption="ADC4 Presynchronized Triggers bit" mask="0x00001000" name="STRGEN4" values="ADCTRGMODE__STRGEN4" />
            <bitfield caption="ADC5 Presynchronized Triggers bit" mask="0x00002000" name="STRGEN5" values="ADCTRGMODE__STRGEN5" />
            <bitfield caption="ADC0 Analog Input Select bit" mask="0x00030000" name="SH0ALT" values="ADCTRGMODE__SH0ALT" />
            <bitfield caption="ADC1 Analog Input Select bit" mask="0x000C0000" name="SH1ALT" values="ADCTRGMODE__SH1ALT" />
            <bitfield caption="ADC2 Analog Input Select bit" mask="0x00300000" name="SH2ALT" values="ADCTRGMODE__SH2ALT" />
            <bitfield caption="ADC3 Analog Input Select bit" mask="0x00C00000" name="SH3ALT" values="ADCTRGMODE__SH3ALT" />
            <bitfield caption="ADC4 Analog Input Select bit" mask="0x03000000" name="SH4ALT" values="ADCTRGMODE__SH4ALT" />
            <bitfield caption="ADC5 Analog Input Select bit" mask="0x0C000000" name="SH5ALT" values="ADCTRGMODE__SH5ALT" />
         </register>
         <register caption="ADC Input Mode Control Register 1" name="ADCIMCON1" offset="0x40" rw="RW" size="4">
            <bitfield caption="AN0 Signed Data Mode bit" mask="0x00000001" name="SIGN0" values="ADCIMCON1__SIGN0" />
            <bitfield caption="AN0 Mode bit" mask="0x00000002" name="DIFF0" values="ADCIMCON1__DIFF0" />
            <bitfield caption="AN1 Signed Data Mode bit" mask="0x00000004" name="SIGN1" values="ADCIMCON1__SIGN1" />
            <bitfield caption="AN1 Mode bit" mask="0x00000008" name="DIFF1" values="ADCIMCON1__DIFF1" />
            <bitfield caption="AN2 Signed Data Mode bit" mask="0x00000010" name="SIGN2" values="ADCIMCON1__SIGN2" />
            <bitfield caption="AN2 Mode bit" mask="0x00000020" name="DIFF2" values="ADCIMCON1__DIFF2" />
            <bitfield caption="AN3 Signed Data Mode bit" mask="0x00000040" name="SIGN3" values="ADCIMCON1__SIGN3" />
            <bitfield caption="AN3 Mode bit" mask="0x00000080" name="DIFF3" values="ADCIMCON1__DIFF3" />
            <bitfield caption="AN4 Signed Data Mode bit" mask="0x00000100" name="SIGN4" values="ADCIMCON1__SIGN4" />
            <bitfield caption="AN4 Mode bit" mask="0x00000200" name="DIFF4" values="ADCIMCON1__DIFF4" />
            <bitfield caption="AN5 Signed Data Mode bit" mask="0x00000400" name="SIGN5" values="ADCIMCON1__SIGN5" />
            <bitfield caption="AN5 Mode bit" mask="0x00000800" name="DIFF5" values="ADCIMCON1__DIFF5" />
            <bitfield caption="AN6 Signed Data Mode bit" mask="0x00001000" name="SIGN6" values="ADCIMCON1__SIGN6" />
            <bitfield caption="AN6 Mode bit" mask="0x00002000" name="DIFF6" values="ADCIMCON1__DIFF6" />
            <bitfield caption="AN7 Signed Data Mode bit" mask="0x00004000" name="SIGN7" values="ADCIMCON1__SIGN7" />
            <bitfield caption="AN7 Mode bit" mask="0x00008000" name="DIFF7" values="ADCIMCON1__DIFF7" />
            <bitfield caption="AN8 Signed Data Mode bit" mask="0x00010000" name="SIGN8" values="ADCIMCON1__SIGN8" />
            <bitfield caption="AN 8 Mode bit" mask="0x00020000" name="DIFF8" values="ADCIMCON1__DIFF8" />
            <bitfield caption="AN9 Signed Data Mode bit" mask="0x00040000" name="SIGN9" values="ADCIMCON1__SIGN9" />
            <bitfield caption="AN9 Mode bit" mask="0x00080000" name="DIFF9" values="ADCIMCON1__DIFF9" />
            <bitfield caption="AN10 Signed Data Mode bit" mask="0x00100000" name="SIGN10" values="ADCIMCON1__SIGN10" />
            <bitfield caption="AN10 Mode bit" mask="0x00200000" name="DIFF10" values="ADCIMCON1__DIFF10" />
            <bitfield caption="AN11 Signed Data Mode bit" mask="0x00400000" name="SIGN11" values="ADCIMCON1__SIGN11" />
            <bitfield caption="AN11 Mode bit" mask="0x00800000" name="DIFF11" values="ADCIMCON1__DIFF11" />
            <bitfield caption="AN12 Signed Data Mode bit" mask="0x01000000" name="SIGN12" values="ADCIMCON1__SIGN12" />
            <bitfield caption="AN12 Mode bit" mask="0x02000000" name="DIFF12" values="ADCIMCON1__DIFF12" />
            <bitfield caption="AN13 Signed Data Mode bit" mask="0x04000000" name="SIGN13" values="ADCIMCON1__SIGN13" />
            <bitfield caption="AN13 Mode bit" mask="0x08000000" name="DIFF13" values="ADCIMCON1__DIFF13" />
            <bitfield caption="AN14 Signed Data Mode bit" mask="0x10000000" name="SIGN14" values="ADCIMCON1__SIGN14" />
            <bitfield caption="AN14 Mode bit" mask="0x20000000" name="DIFF14" values="ADCIMCON1__DIFF14" />
            <bitfield caption="NO_SUCH_FIELD" mask="0x40000000" name="SIGN15" values="ADCIMCON1__SIGN15" />
            <bitfield caption="AN15 Mode bit" mask="0x80000000" name="DIFF15" values="ADCIMCON1__DIFF15" />
         </register>
         <register caption="ADC Input Mode Control Register 2" name="ADCIMCON2" offset="0x50" rw="RW" size="4">
            <bitfield caption="AN16 Signed Data Mode bit" mask="0x00000001" name="SIGN16" values="ADCIMCON2__SIGN16" />
            <bitfield caption="AN16 Mode bit" mask="0x00000002" name="DIFF16" values="ADCIMCON2__DIFF16" />
            <bitfield caption="AN17 Signed Data Mode bit" mask="0x00000004" name="SIGN17" values="ADCIMCON2__SIGN17" />
            <bitfield caption="AN17 Mode bit" mask="0x00000008" name="DIFF17" values="ADCIMCON2__DIFF17" />
            <bitfield caption="AN18 Signed Data Mode bit" mask="0x00000010" name="SIGN18" values="ADCIMCON2__SIGN18" />
            <bitfield caption="AN18 Mode bit" mask="0x00000020" name="DIFF18" values="ADCIMCON2__DIFF18" />
            <bitfield caption="AN19 Signed Data Mode bit" mask="0x00000040" name="SIGN19" values="ADCIMCON2__SIGN19" />
            <bitfield caption="AN19 Mode bit" mask="0x00000080" name="DIFF19" values="ADCIMCON2__DIFF19" />
            <bitfield caption="AN20 Signed Data Mode bit" mask="0x00000100" name="SIGN20" values="ADCIMCON2__SIGN20" />
            <bitfield caption="AN20 Mode bit" mask="0x00000200" name="DIFF20" values="ADCIMCON2__DIFF20" />
            <bitfield caption="AN21 Signed Data Mode bit" mask="0x00000400" name="SIGN21" values="ADCIMCON2__SIGN21" />
            <bitfield caption="AN21 Mode bit" mask="0x00000800" name="DIFF21" values="ADCIMCON2__DIFF21" />
            <bitfield caption="AN22 Signed Data Mode bit" mask="0x00001000" name="SIGN22" values="ADCIMCON2__SIGN22" />
            <bitfield caption="AN22 Mode bit" mask="0x00002000" name="DIFF22" values="ADCIMCON2__DIFF22" />
            <bitfield caption="AN23 Signed Data Mode bit" mask="0x00004000" name="SIGN23" values="ADCIMCON2__SIGN23" />
            <bitfield caption="AN23 Mode bit" mask="0x00008000" name="DIFF23" values="ADCIMCON2__DIFF23" />
            <bitfield caption="AN24 Signed Data Mode bit" mask="0x00010000" name="SIGN24" values="ADCIMCON2__SIGN24" />
            <bitfield caption="AN24 Mode bit" mask="0x00020000" name="DIFF24" values="ADCIMCON2__DIFF24" />
            <bitfield caption="AN25 Signed Data Mode bit" mask="0x00040000" name="SIGN25" values="ADCIMCON2__SIGN25" />
            <bitfield caption="AN25 Mode bit" mask="0x00080000" name="DIFF25" values="ADCIMCON2__DIFF25" />
            <bitfield caption="AN26 Signed Data Mode bit" mask="0x00100000" name="SIGN26" values="ADCIMCON2__SIGN26" />
            <bitfield caption="AN26 Mode bit" mask="0x00200000" name="DIFF26" values="ADCIMCON2__DIFF26" />
            <bitfield caption="AN27 Signed Data Mode bit" mask="0x00400000" name="SIGN27" values="ADCIMCON2__SIGN27" />
            <bitfield caption="AN27 Mode bit" mask="0x00800000" name="DIFF27" values="ADCIMCON2__DIFF27" />
         </register>
         <register caption="ADC Input Mode Control Register 3" name="ADCIMCON3" offset="0x60" rw="RW" size="4">
            <bitfield caption="AN33 Signed Data Mode bit" mask="0x00000004" name="SIGN33" values="ADCIMCON3__SIGN33" />
            <bitfield caption="AN33 Mode bit" mask="0x00000008" name="DIFF33" values="ADCIMCON3__DIFF33" />
            <bitfield caption="AN34 Signed Data Mode bit" mask="0x00000010" name="SIGN34" values="ADCIMCON3__SIGN34" />
            <bitfield caption="AN34 Mode bit" mask="0x00000020" name="DIFF34" values="ADCIMCON3__DIFF34" />
            <bitfield caption="AN35 Signed Data Mode bit" mask="0x00000040" name="SIGN35" values="ADCIMCON3__SIGN35" />
            <bitfield caption="AN35 Mode bit" mask="0x00000080" name="DIFF35" values="ADCIMCON3__DIFF35" />
            <bitfield caption="AN36 Signed Data Mode bit" mask="0x00000100" name="SIGN36" values="ADCIMCON3__SIGN36" />
            <bitfield caption="AN36 Mode bit" mask="0x00000200" name="DIFF36" values="ADCIMCON3__DIFF36" />
            <bitfield caption="AN37 Signed Data Mode bit" mask="0x00000400" name="SIGN37" values="ADCIMCON3__SIGN37" />
            <bitfield caption="AN37 Mode bit" mask="0x00000800" name="DIFF37" values="ADCIMCON3__DIFF37" />
            <bitfield caption="AN38 Signed Data Mode bit" mask="0x00001000" name="SIGN38" values="ADCIMCON3__SIGN38" />
            <bitfield caption="AN38 Mode bit" mask="0x00002000" name="DIFF38" values="ADCIMCON3__DIFF38" />
            <bitfield caption="AN39 Signed Data Mode bit" mask="0x00004000" name="SIGN39" values="ADCIMCON3__SIGN39" />
            <bitfield caption="AN39 Mode bit" mask="0x00008000" name="DIFF39" values="ADCIMCON3__DIFF39" />
            <bitfield caption="AN40 Signed Data Mode bit" mask="0x00010000" name="SIGN40" values="ADCIMCON3__SIGN40" />
            <bitfield caption="AN40 Mode bit" mask="0x00020000" name="DIFF40" values="ADCIMCON3__DIFF40" />
            <bitfield caption="AN41 Signed Data Mode bit" mask="0x00040000" name="SIGN41" values="ADCIMCON3__SIGN41" />
            <bitfield caption="AN41 Mode bit" mask="0x00080000" name="DIFF41" values="ADCIMCON3__DIFF41" />
            <bitfield caption="NO_SUCH_FIELD" mask="0x04000000" name="SIGN45" values="ADCIMCON3__SIGN45" />
            <bitfield caption="AN45 Mode bit" mask="0x08000000" name="DIFF45" values="ADCIMCON3__DIFF45" />
            <bitfield caption="AN45 Signed Data Mode bit" mask="0x10000000" name="SIGN46" values="ADCIMCON3__SIGN46" />
            <bitfield caption="AN46 Mode bit" mask="0x20000000" name="DIFF46" values="ADCIMCON3__DIFF46" />
            <bitfield caption="AN47 Signed Data Mode bit" mask="0x40000000" name="SIGN47" values="ADCIMCON3__SIGN47" />
            <bitfield caption="AN47 Mode bit" mask="0x80000000" name="DIFF47" values="ADCIMCON3__DIFF47" />
         </register>
         <register caption="ADC Input Mode Control Register 4" name="ADCIMCON4" offset="0x70" rw="RW" size="4">
            <bitfield caption="AN48 Signed Data Mode bit" mask="0x00000001" name="SIGN48" values="ADCIMCON4__SIGN48" />
            <bitfield caption="AN48 Mode bit" mask="0x00000002" name="DIFF48" values="ADCIMCON4__DIFF48" />
            <bitfield caption="AN41 Signed Data Mode bit" mask="0x00000004" name="SIGN49" values="ADCIMCON4__SIGN49" />
            <bitfield caption="AN49 Mode bit" mask="0x00000008" name="DIFF49" values="ADCIMCON4__DIFF49" />
         </register>
         <register caption="ADC Global Interrupt Enable Register 1" name="ADCGIRQEN1" offset="0x80" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000001" name="AGIEN0" values="ADCGIRQEN1__AGIEN0" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000002" name="AGIEN1" values="ADCGIRQEN1__AGIEN1" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000004" name="AGIEN2" values="ADCGIRQEN1__AGIEN2" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000008" name="AGIEN3" values="ADCGIRQEN1__AGIEN3" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000010" name="AGIEN4" values="ADCGIRQEN1__AGIEN4" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000020" name="AGIEN5" values="ADCGIRQEN1__AGIEN5" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000040" name="AGIEN6" values="ADCGIRQEN1__AGIEN6" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000080" name="AGIEN7" values="ADCGIRQEN1__AGIEN7" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000100" name="AGIEN8" values="ADCGIRQEN1__AGIEN8" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000200" name="AGIEN9" values="ADCGIRQEN1__AGIEN9" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000400" name="AGIEN10" values="ADCGIRQEN1__AGIEN10" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000800" name="AGIEN11" values="ADCGIRQEN1__AGIEN11" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00001000" name="AGIEN12" values="ADCGIRQEN1__AGIEN12" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00002000" name="AGIEN13" values="ADCGIRQEN1__AGIEN13" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00004000" name="AGIEN14" values="ADCGIRQEN1__AGIEN14" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00008000" name="AGIEN15" values="ADCGIRQEN1__AGIEN15" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00010000" name="AGIEN16" values="ADCGIRQEN1__AGIEN16" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00020000" name="AGIEN17" values="ADCGIRQEN1__AGIEN17" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00040000" name="AGIEN18" values="ADCGIRQEN1__AGIEN18" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00080000" name="AGIEN19" values="ADCGIRQEN1__AGIEN19" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00100000" name="AGIEN20" values="ADCGIRQEN1__AGIEN20" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00200000" name="AGIEN21" values="ADCGIRQEN1__AGIEN21" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00400000" name="AGIEN22" values="ADCGIRQEN1__AGIEN22" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00800000" name="AGIEN23" values="ADCGIRQEN1__AGIEN23" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x01000000" name="AGIEN24" values="ADCGIRQEN1__AGIEN24" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x02000000" name="AGIEN25" values="ADCGIRQEN1__AGIEN25" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x04000000" name="AGIEN26" values="ADCGIRQEN1__AGIEN26" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x08000000" name="AGIEN27" values="ADCGIRQEN1__AGIEN27" />
         </register>
         <register caption="ADC Global Interrupt Enable Register 2" name="ADCGIRQEN2" offset="0x90" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000002" name="AGIEN33" values="ADCGIRQEN2__AGIEN33" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000004" name="AGIEN34" values="ADCGIRQEN2__AGIEN34" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000008" name="AGIEN35" values="ADCGIRQEN2__AGIEN35" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000010" name="AGIEN36" values="ADCGIRQEN2__AGIEN36" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000020" name="AGIEN37" values="ADCGIRQEN2__AGIEN37" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000040" name="AGIEN38" values="ADCGIRQEN2__AGIEN38" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000080" name="AGIEN39" values="ADCGIRQEN2__AGIEN39" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000100" name="AGIEN40" values="ADCGIRQEN2__AGIEN40" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000200" name="AGIEN41" values="ADCGIRQEN2__AGIEN41" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00002000" name="AGIEN45" values="ADCGIRQEN2__AGIEN45" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00004000" name="AGIEN46" values="ADCGIRQEN2__AGIEN46" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00008000" name="AGIEN47" values="ADCGIRQEN2__AGIEN47" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00010000" name="AGIEN48" values="ADCGIRQEN2__AGIEN48" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00020000" name="AGIEN49" values="ADCGIRQEN2__AGIEN49" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00040000" name="AGIEN50" values="ADCGIRQEN2__AGIEN50" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00080000" name="AGIEN51" values="ADCGIRQEN2__AGIEN51" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00100000" name="AGIEN52" values="ADCGIRQEN2__AGIEN52" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00200000" name="AGIEN53" values="ADCGIRQEN2__AGIEN53" />
         </register>
