Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN1">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN2">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN3">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN4">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN5">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN6">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN7">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN8">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN9">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN10">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN11">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN12">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN13">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN14">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN15">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN16">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN17">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN18">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
