Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN2">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN3">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN4">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN5">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="2^15 = 32768 clocks" name="" value="0xf" />
         <value caption="2^14 = 16384 clocks" name="" value="0xe" />
         <value caption="2^13 = 8192 clocks" name="" value="0xd" />
         <value caption="2^12 = 4096 clocks" name="" value="0xc" />
         <value caption="2^11 = 2048 clocks" name="" value="0xb" />
         <value caption="2^10 = 1024 clocks" name="" value="0xa" />
         <value caption="2^9 = 512 clocks" name="" value="0x9" />
         <value caption="2^8 = 256 clocks" name="" value="0x8" />
         <value caption="2^7 = 128 clocks" name="" value="0x7" />
         <value caption="2^6 = 64 clocks" name="" value="0x6" />
         <value caption="2^5 = 32 clocks" name="" value="0x5" />
         <value caption="2^4 = 16 clocks" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01445" name="CDAC" version="">
      <register-group name="CDAC">
         <register caption="CDAC Control Register" name="DAC1CON" offset="0xC200" rw="RW" size="4">
            <bitfield caption="Reference Source Select bits" mask="0x00000003" name="REFSEL" values="DAC1CON__REFSEL" />
            <bitfield caption="CDAC Output Buffer Enable bit" mask="0x00000100" name="DACOE" values="DAC1CON__DACOE" />
            <bitfield caption="CDAC Enable bit" mask="0x00008000" name="ON" values="DAC1CON__ON" />
            <bitfield mask="0xFFFF0000" name="DACDAT" />
         </register>
         <register caption="CDAC Control Register" name="DAC2CON" offset="0xC400" rw="RW" size="4">
            <bitfield caption="Reference Source Select bits" mask="0x00000003" name="REFSEL" values="DAC2CON__REFSEL" />
            <bitfield caption="CDAC Output Buffer Enable bit" mask="0x00000100" name="DACOE" values="DAC2CON__DACOE" />
            <bitfield caption="CDAC Enable bit" mask="0x00008000" name="ON" values="DAC2CON__ON" />
            <bitfield mask="0xFFFF0000" name="DACDAT" />
         </register>
         <register caption="CDAC Control Register" name="DAC3CON" offset="0xC600" rw="RW" size="4">
            <bitfield caption="Reference Source Select bits" mask="0x00000003" name="REFSEL" values="DAC3CON__REFSEL" />
            <bitfield caption="CDAC Output Buffer Enable bit" mask="0x00000100" name="DACOE" values="DAC3CON__DACOE" />
            <bitfield caption="CDAC Enable bit" mask="0x00008000" name="ON" values="DAC3CON__ON" />
            <bitfield mask="0xFFFF0000" name="DACDAT" />
         </register>
      </register-group>
      <value-group caption="Reference Source Select bits" name="DAC1CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC1CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC1CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Source Select bits" name="DAC2CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC2CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC2CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Source Select bits" name="DAC3CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
