Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD" />
            <bitfield mask="0x00000002" name="T2MD" />
            <bitfield mask="0x00000004" name="T3MD" />
            <bitfield mask="0x00000008" name="T4MD" />
            <bitfield mask="0x00000010" name="T5MD" />
            <bitfield mask="0x00000020" name="T6MD" />
            <bitfield mask="0x00000040" name="T7MD" />
            <bitfield mask="0x00000080" name="T8MD" />
            <bitfield mask="0x00000100" name="T9MD" />
            <bitfield mask="0x00010000" name="PWM1MD" />
            <bitfield mask="0x00020000" name="PWM2MD" />
            <bitfield mask="0x00040000" name="PWM3MD" />
            <bitfield mask="0x00080000" name="PWM4MD" />
            <bitfield mask="0x00100000" name="PWM5MD" />
            <bitfield mask="0x00200000" name="PWM6MD" />
            <bitfield mask="0x00400000" name="PWM7MD" />
            <bitfield mask="0x00800000" name="PWM8MD" />
            <bitfield mask="0x01000000" name="PWM9MD" />
            <bitfield mask="0x02000000" name="PWM10MD" />
            <bitfield mask="0x04000000" name="PWM11MD" />
            <bitfield mask="0x08000000" name="PWM12MD" />
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD" />
            <bitfield mask="0x00000002" name="U2MD" />
            <bitfield mask="0x00000004" name="U3MD" />
            <bitfield mask="0x00000008" name="U4MD" />
            <bitfield mask="0x00000010" name="U5MD" />
            <bitfield mask="0x00000020" name="U6MD" />
            <bitfield mask="0x00000100" name="SPI1MD" />
            <bitfield mask="0x00000200" name="SPI2MD" />
            <bitfield mask="0x00000400" name="SPI3MD" />
            <bitfield mask="0x00000800" name="SPI4MD" />
            <bitfield mask="0x00001000" name="SPI5MD" />
            <bitfield mask="0x00002000" name="SPI6MD" />
            <bitfield mask="0x00010000" name="I2C1MD" />
            <bitfield mask="0x00020000" name="I2C2MD" />
            <bitfield mask="0x00040000" name="I2C3MD" />
            <bitfield mask="0x00080000" name="I2C4MD" />
            <bitfield mask="0x01000000" name="USB1MD" />
            <bitfield mask="0x02000000" name="USB2MD" />
            <bitfield mask="0x10000000" name="CAN1MD" />
            <bitfield mask="0x20000000" name="CAN2MD" />
            <bitfield mask="0x40000000" name="CAN3MD" />
            <bitfield mask="0x80000000" name="CAN4MD" />
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000100" name="REFO1MD" />
            <bitfield mask="0x00000200" name="REFO2MD" />
            <bitfield mask="0x00000400" name="REFO3MD" />
            <bitfield mask="0x00000800" name="REFO4MD" />
            <bitfield mask="0x00010000" name="PMPMD" />
            <bitfield mask="0x00040000" name="QEI5MD" />
            <bitfield mask="0x00080000" name="QEI6MD" />
            <bitfield mask="0x01000000" name="QEI1MD" />
            <bitfield mask="0x02000000" name="QEI2MD" />
            <bitfield mask="0x04000000" name="QEI3MD" />
            <bitfield mask="0x08000000" name="QEI4MD" />
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD" />
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield caption="CPU Instruction Space Permission Group bits" mask="0x00000003" name="CPUPG" values="CFGPG__CPUPG" />
            <bitfield caption="CPU Instruction Data Space Permission Group bits" mask="0x0000000C" name="CPUDSPG" values="CFGPG__CPUDSPG" />
            <bitfield caption="DMA Module Permission Group bits" mask="0x00000030" name="DMAPG" values="CFGPG__DMAPG" />
            <bitfield caption="CAN1 Module Permission Group bits" mask="0x00003000" name="CAN1PG" values="CFGPG__CAN1PG" />
            <bitfield caption="Flash Control Permission Group bits" mask="0x00C00000" name="FCPG" values="CFGPG__FCPG" />
            <bitfield caption="ADC Permission bits" mask="0x03000000" name="ADCPG" values="CFGPG__ADCPG" />
            <bitfield caption="JTAG Permission Group bits" mask="0x30000000" name="JTAGPG" values="CFGPG__JTAGPG" />
         </register>
         <register caption="" name="CFGAPP2" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Primary Oscillator Unable to Lock Status Read-only bit" mask="0x00200000" name="POSCFAIL" values="CFGAPP2__POSCFAIL" />
         </register>
         <register caption="" name="CFGCON2" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="EEWS" />
         </register>
      </register-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3" />
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2" />
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1" />
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0" />
      </value-group>
