Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x1" />
         <value caption="Charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Permission Group Lock bit" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1" />
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable bit" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN1">
         <value caption="PWM1L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM1L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN2">
         <value caption="PWM2L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM2L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN3">
         <value caption="PWM3L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM3L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN4">
         <value caption="PWM4L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM4L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN5">
         <value caption="PWM5L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM5L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN6">
         <value caption="PWM6L functionality is replaced by PWMxH(x+6) functionality" name="" value="0x1" />
         <value caption="PWM6L functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Arbitration Priority to SRAM bit" name="CFGCON__ADCPRI">
         <value caption="ADC gets High Priority access to SRAM" name="" value="0x1" />
         <value caption="ADC uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction Space Permission Group bits" name="CFGPG__CPUPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction Data Space Permission Group bits" name="CFGPG__CPUDSPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Module Permission Group bits" name="CFGPG__DMAPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN1 Module Permission Group bits" name="CFGPG__CAN1PG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
