Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="TIMEOUT" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="NOTIMEOUT" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="RESET" value="0x1" />
         <value caption="Software Reset was not executed" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="RESET" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="RESET" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Mode Flag bit" name="RCON__DPSLP">
         <value caption="Deep Sleep mode has occurred" name="SLEEP" value="0x1" />
         <value caption="Deep Sleep mode has not occurred" name="NOSLEEP" value="0x0" />
      </value-group>
      <value-group caption="VBAT Mode Flag bit" name="RCON__VBAT">
         <value caption="A POR exit from VBAT has occurred" name="POR" value="0x1" />
         <value caption="A POR exit from VBAT has not occurred" name="NOPOR" value="0x0" />
      </value-group>
      <value-group caption="VBPOR Mode Flag bit" name="RCON__VBPOR">
         <value caption="A VBAT domain POR has occurred" name="POR" value="0x1" />
         <value caption="A VBAT domain POR has not occurred" name="NOPOR" value="0x0" />
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="ERROR" value="0x1" />
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="NOERROR" value="0x0" />
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="ERROR" value="0x1" />
         <value caption="No error occurred during a read of the primary configuration registers" name="NOERROR" value="0x0" />
      </value-group>
      <value-group caption="Core Voltage POR Flag bit" name="RCON__PORCORE">
         <value caption="A Power-up Reset has occurred due to Core Voltage" name="RESET" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to Core Voltage" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="I/O Voltage POR Flag bit" name="RCON__PORIO">
         <value caption="A Power-up Reset has occurred due to I/O Voltage" name="RESET" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to I/O Voltage" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="RESET" value="0x1" />
         <value caption="No effect" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT" >
         <value caption="No delay between NMI assertion and device Reset event" name="NODELAY" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="TIMEOUT" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="NOTIMEOUT" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="CLKFAIL" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="NOCKFAIL" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="EVENT" value="0x1" />
         <value caption="A general NMI event has not been detected" name="NOEVENT" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="GENERATE_NMI" value="0x1" />
         <value caption="An NMI will not be generated" name="NO_NMI" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="TIMEOUT" value="0x1" />
         <value caption="WDT time-out has not occurred" name="NO_TIMEOUT" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="TIMEOUT" value="0x1" />
         <value caption="DMT time-out has not occurred" name="NO_TIMEOUT" value="0x0" />
      </value-group>
      <value-group caption="Internal Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="ACTIVE" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="STANDBY" value="0x0" />
      </value-group>
      <value-group caption="USB PLL (UPLL) Ready Status bit" name="CLKSTAT__UPLLRDY">
         <value caption="UPLL is ready" name="" value="0x1" />
         <value caption="UPLL is not ready" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01461" name="CTMU" version="1">
      <register-group name="CTMU">
         <register caption="CTMU Control Register" name="CTMUCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Current Range Select bits" mask="0x00000003" name="IRNG" values="CTMUCON__IRNG" />
            <bitfield caption="Current Source Trim bits" mask="0x000000FC" name="ITRIM" values="CTMUCON__ITRIM" />
            <bitfield caption="Trigger Control bit" mask="0x00000100" name="CTTRIG" values="CTMUCON__CTTRIG" />
            <bitfield caption="Analog Current Source Control bit" mask="0x00000200" name="IDISSEN" values="CTMUCON__IDISSEN" />
            <bitfield caption="Edge Sequence Enable bit" mask="0x00000400" name="EDGSEQEN" values="CTMUCON__EDGSEQEN" />
            <bitfield caption="Edge Enable bit" mask="0x00000800" name="EDGEN" values="CTMUCON__EDGEN" />
            <bitfield caption="Time Generation Enable bit" mask="0x00001000" name="TGEN" values="CTMUCON__TGEN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="CTMUSIDL" values="CTMUCON__CTMUSIDL" />
            <bitfield caption="ON Enable bit" mask="0x00008000" name="ON" values="CTMUCON__ON" />
            <bitfield caption="Edge 2 Source Select bits" mask="0x003C0000" name="EDG2SEL" values="CTMUCON__EDG2SEL" />
            <bitfield caption="Edge 2 Polarity Select bit" mask="0x00400000" name="EDG2POL" values="CTMUCON__EDG2POL" />
            <bitfield caption="Edge2 Edge Sampling Select bit" mask="0x00800000" name="EDG2MOD" values="CTMUCON__EDG2MOD" />
            <bitfield caption="Edge1 Status bit" mask="0x01000000" name="EDG1STAT" values="CTMUCON__EDG1STAT" />
            <bitfield caption="Edge2 Status bit" mask="0x02000000" name="EDG2STAT" values="CTMUCON__EDG2STAT" />
            <bitfield caption="Edge 1 Source Select bits" mask="0x3C000000" name="EDG1SEL" values="CTMUCON__EDG1SEL" />
            <bitfield caption="Edge 1 Polarity Select bit" mask="0x40000000" name="EDG1POL" values="CTMUCON__EDG1POL" />
            <bitfield caption="Edge1 Edge Sampling Select bit" mask="0x80000000" name="EDG1MOD" values="CTMUCON__EDG1MOD" />
         </register>
      </register-group>
      <value-group caption="Current Range Select bits" name="CTMUCON__IRNG">
         <value caption="100 times base current" name="" value="0x3" />
         <value caption="10 times base current" name="" value="0x2" />
         <value caption="Base current level" name="" value="0x1" />
         <value caption="1000 times base current" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Source Trim bits" name="CTMUCON__ITRIM">
         <value caption="Maximum positive change from nominal current" name="" value="0x1f" />
         <value caption="Minimum positive change from nominal current" name="" value="0x1" />
         <value caption="Nominal current output specified by IRNG" name="" value="0x0" />
         <value caption="Minimum negative change from nominal current" name="" value="0x3f" />
         <value caption="Maximum negative change from nominal current" name="" value="0x21" />
      </value-group>
      <value-group caption="Trigger Control bit" name="CTMUCON__CTTRIG">
         <value caption="Trigger output is enabled" name="" value="0x1" />
         <value caption="Trigger output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Current Source Control bit" name="CTMUCON__IDISSEN">
         <value caption="Analog current source output is grounded" name="" value="0x1" />
         <value caption="Analog current source output is not grounded" name="" value="0x0" />
      </value-group>
