Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="" name="CNPUD" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUD" />
            <bitfield mask="0x00000002" name="CNPUD" />
            <bitfield mask="0x00000004" name="CNPUD" />
            <bitfield mask="0x00000008" name="CNPUD" />
            <bitfield mask="0x00000010" name="CNPUD" />
            <bitfield mask="0x00000020" name="CNPUD" />
            <bitfield mask="0x00000040" name="CNPUD" />
            <bitfield mask="0x00000080" name="CNPUD" />
            <bitfield mask="0x00000100" name="CNPUD" />
            <bitfield mask="0x00000200" name="CNPUD" />
            <bitfield mask="0x00000400" name="CNPUD" />
            <bitfield mask="0x00000800" name="CNPUD" />
            <bitfield mask="0x00001000" name="CNPUD" />
            <bitfield mask="0x00002000" name="CNPUD" />
            <bitfield mask="0x00004000" name="CNPUD" />
            <bitfield mask="0x00008000" name="CNPUD" />
         </register>
         <register caption="" name="CNPUE" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUE" />
            <bitfield mask="0x00000002" name="CNPUE" />
            <bitfield mask="0x00000004" name="CNPUE" />
            <bitfield mask="0x00000008" name="CNPUE" />
            <bitfield mask="0x00000010" name="CNPUE" />
            <bitfield mask="0x00000020" name="CNPUE" />
            <bitfield mask="0x00000040" name="CNPUE" />
            <bitfield mask="0x00000080" name="CNPUE" />
            <bitfield mask="0x00000100" name="CNPUE" />
            <bitfield mask="0x00000200" name="CNPUE" />
            <bitfield mask="0x00000400" name="CNPUE" />
            <bitfield mask="0x00000800" name="CNPUE" />
            <bitfield mask="0x00001000" name="CNPUE" />
            <bitfield mask="0x00002000" name="CNPUE" />
            <bitfield mask="0x00004000" name="CNPUE" />
            <bitfield mask="0x00008000" name="CNPUE" />
         </register>
         <register caption="" name="CNPUF" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUF" />
            <bitfield mask="0x00000002" name="CNPUF" />
            <bitfield mask="0x00000004" name="CNPUF" />
            <bitfield mask="0x00000008" name="CNPUF" />
            <bitfield mask="0x00000010" name="CNPUF" />
            <bitfield mask="0x00000020" name="CNPUF" />
            <bitfield mask="0x00000040" name="CNPUF" />
            <bitfield mask="0x00000080" name="CNPUF" />
            <bitfield mask="0x00000100" name="CNPUF" />
            <bitfield mask="0x00000200" name="CNPUF" />
            <bitfield mask="0x00000400" name="CNPUF" />
            <bitfield mask="0x00000800" name="CNPUF" />
            <bitfield mask="0x00001000" name="CNPUF" />
            <bitfield mask="0x00002000" name="CNPUF" />
            <bitfield mask="0x00004000" name="CNPUF" />
            <bitfield mask="0x00008000" name="CNPUF" />
         </register>
         <register caption="" name="CNPUG" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUG" />
            <bitfield mask="0x00000002" name="CNPUG" />
            <bitfield mask="0x00000004" name="CNPUG" />
            <bitfield mask="0x00000008" name="CNPUG" />
            <bitfield mask="0x00000010" name="CNPUG" />
            <bitfield mask="0x00000020" name="CNPUG" />
            <bitfield mask="0x00000040" name="CNPUG" />
            <bitfield mask="0x00000080" name="CNPUG" />
            <bitfield mask="0x00000100" name="CNPUG" />
            <bitfield mask="0x00000200" name="CNPUG" />
            <bitfield mask="0x00000400" name="CNPUG" />
            <bitfield mask="0x00000800" name="CNPUG" />
            <bitfield mask="0x00001000" name="CNPUG" />
            <bitfield mask="0x00002000" name="CNPUG" />
            <bitfield mask="0x00004000" name="CNPUG" />
            <bitfield mask="0x00008000" name="CNPUG" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA" />
            <bitfield mask="0x00000002" name="CNPDA" />
            <bitfield mask="0x00000004" name="CNPDA" />
            <bitfield mask="0x00000008" name="CNPDA" />
            <bitfield mask="0x00000010" name="CNPDA" />
            <bitfield mask="0x00000020" name="CNPDA" />
            <bitfield mask="0x00000040" name="CNPDA" />
            <bitfield mask="0x00000080" name="CNPDA" />
            <bitfield mask="0x00000100" name="CNPDA" />
            <bitfield mask="0x00000200" name="CNPDA" />
            <bitfield mask="0x00000400" name="CNPDA" />
            <bitfield mask="0x00000800" name="CNPDA" />
            <bitfield mask="0x00001000" name="CNPDA" />
            <bitfield mask="0x00002000" name="CNPDA" />
            <bitfield mask="0x00004000" name="CNPDA" />
            <bitfield mask="0x00008000" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB" />
            <bitfield mask="0x00000002" name="CNPDB" />
            <bitfield mask="0x00000004" name="CNPDB" />
            <bitfield mask="0x00000008" name="CNPDB" />
            <bitfield mask="0x00000010" name="CNPDB" />
            <bitfield mask="0x00000020" name="CNPDB" />
            <bitfield mask="0x00000040" name="CNPDB" />
            <bitfield mask="0x00000080" name="CNPDB" />
            <bitfield mask="0x00000100" name="CNPDB" />
            <bitfield mask="0x00000200" name="CNPDB" />
            <bitfield mask="0x00000400" name="CNPDB" />
            <bitfield mask="0x00000800" name="CNPDB" />
            <bitfield mask="0x00001000" name="CNPDB" />
            <bitfield mask="0x00002000" name="CNPDB" />
            <bitfield mask="0x00004000" name="CNPDB" />
            <bitfield mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC" />
            <bitfield mask="0x00000002" name="CNPDC" />
            <bitfield mask="0x00000004" name="CNPDC" />
            <bitfield mask="0x00000008" name="CNPDC" />
            <bitfield mask="0x00000010" name="CNPDC" />
            <bitfield mask="0x00000020" name="CNPDC" />
            <bitfield mask="0x00000040" name="CNPDC" />
            <bitfield mask="0x00000080" name="CNPDC" />
            <bitfield mask="0x00000100" name="CNPDC" />
            <bitfield mask="0x00000200" name="CNPDC" />
            <bitfield mask="0x00000400" name="CNPDC" />
            <bitfield mask="0x00000800" name="CNPDC" />
            <bitfield mask="0x00001000" name="CNPDC" />
            <bitfield mask="0x00002000" name="CNPDC" />
            <bitfield mask="0x00004000" name="CNPDC" />
            <bitfield mask="0x00008000" name="CNPDC" />
         </register>
         <register caption="" name="CNPDD" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDD" />
            <bitfield mask="0x00000002" name="CNPDD" />
            <bitfield mask="0x00000004" name="CNPDD" />
            <bitfield mask="0x00000008" name="CNPDD" />
            <bitfield mask="0x00000010" name="CNPDD" />
            <bitfield mask="0x00000020" name="CNPDD" />
            <bitfield mask="0x00000040" name="CNPDD" />
            <bitfield mask="0x00000080" name="CNPDD" />
            <bitfield mask="0x00000100" name="CNPDD" />
            <bitfield mask="0x00000200" name="CNPDD" />
            <bitfield mask="0x00000400" name="CNPDD" />
            <bitfield mask="0x00000800" name="CNPDD" />
            <bitfield mask="0x00001000" name="CNPDD" />
            <bitfield mask="0x00002000" name="CNPDD" />
            <bitfield mask="0x00004000" name="CNPDD" />
            <bitfield mask="0x00008000" name="CNPDD" />
         </register>
         <register caption="" name="CNPDE" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDE" />
            <bitfield mask="0x00000002" name="CNPDE" />
            <bitfield mask="0x00000004" name="CNPDE" />
            <bitfield mask="0x00000008" name="CNPDE" />
            <bitfield mask="0x00000010" name="CNPDE" />
            <bitfield mask="0x00000020" name="CNPDE" />
            <bitfield mask="0x00000040" name="CNPDE" />
            <bitfield mask="0x00000080" name="CNPDE" />
            <bitfield mask="0x00000100" name="CNPDE" />
            <bitfield mask="0x00000200" name="CNPDE" />
            <bitfield mask="0x00000400" name="CNPDE" />
            <bitfield mask="0x00000800" name="CNPDE" />
            <bitfield mask="0x00001000" name="CNPDE" />
            <bitfield mask="0x00002000" name="CNPDE" />
            <bitfield mask="0x00004000" name="CNPDE" />
            <bitfield mask="0x00008000" name="CNPDE" />
         </register>
         <register caption="" name="CNPDF" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDF" />
            <bitfield mask="0x00000002" name="CNPDF" />
            <bitfield mask="0x00000004" name="CNPDF" />
            <bitfield mask="0x00000008" name="CNPDF" />
            <bitfield mask="0x00000010" name="CNPDF" />
            <bitfield mask="0x00000020" name="CNPDF" />
            <bitfield mask="0x00000040" name="CNPDF" />
            <bitfield mask="0x00000080" name="CNPDF" />
            <bitfield mask="0x00000100" name="CNPDF" />
            <bitfield mask="0x00000200" name="CNPDF" />
            <bitfield mask="0x00000400" name="CNPDF" />
            <bitfield mask="0x00000800" name="CNPDF" />
            <bitfield mask="0x00001000" name="CNPDF" />
            <bitfield mask="0x00002000" name="CNPDF" />
            <bitfield mask="0x00004000" name="CNPDF" />
            <bitfield mask="0x00008000" name="CNPDF" />
         </register>
         <register caption="" name="CNPDG" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDG" />
            <bitfield mask="0x00000002" name="CNPDG" />
            <bitfield mask="0x00000004" name="CNPDG" />
            <bitfield mask="0x00000008" name="CNPDG" />
            <bitfield mask="0x00000010" name="CNPDG" />
            <bitfield mask="0x00000020" name="CNPDG" />
            <bitfield mask="0x00000040" name="CNPDG" />
            <bitfield mask="0x00000080" name="CNPDG" />
            <bitfield mask="0x00000100" name="CNPDG" />
            <bitfield mask="0x00000200" name="CNPDG" />
            <bitfield mask="0x00000400" name="CNPDG" />
            <bitfield mask="0x00000800" name="CNPDG" />
            <bitfield mask="0x00001000" name="CNPDG" />
            <bitfield mask="0x00002000" name="CNPDG" />
            <bitfield mask="0x00004000" name="CNPDG" />
            <bitfield mask="0x00008000" name="CNPDG" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONA__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONB__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONC__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCOND__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONE" offset="0x470" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONE__EDGEDETECT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONE__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON" />
         </register>
