Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CNCOND__SIDL">
         <value caption="CPU Idle mode halts CN operation." name="" value="0x1" />
         <value caption="CPU Idle mode does not affect CN operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CNCONE__SIDL">
         <value caption="CPU Idle mode halts CN operation." name="" value="0x1" />
         <value caption="CPU Idle mode does not affect CN operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CNCONF__SIDL">
         <value caption="CPU Idle mode halts CN operation." name="" value="0x1" />
         <value caption="CPU Idle mode does not affect CN operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CNCONG__SIDL">
         <value caption="CPU Idle mode halts CN operation." name="" value="0x1" />
         <value caption="CPU Idle mode does not affect CN operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="Disable HLVD Output bit" mask="0x00000080" name="DISOUT" values="HLVDCON__DISOUT" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLEVT" values="HLVDCON__HLEVT" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="HLVDCON__SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="1.2V (Selects external LVDIN pin)" name="" value="0xf" />
         <value caption="2.00V" name="" value="0xe" />
         <value caption="2.12V" name="" value="0xd" />
         <value caption="2.20V" name="" value="0xc" />
         <value caption="2.30V" name="" value="0xb" />
         <value caption="2.4V" name="" value="0xa" />
         <value caption="2.5V" name="" value="0x9" />
         <value caption="2.7V" name="" value="0x8" />
         <value caption="2.79V" name="" value="0x7" />
         <value caption="3.0V" name="" value="0x6" />
         <value caption="3.29V" name="" value="0x5" />
         <value caption="3.52V" name="" value="0x4" />
      </value-group>
      <value-group caption="Disable HLVD Output bit" name="HLVDCON__DISOUT">
         <value caption="Enable output of HLVD Comparator. Once set, can only be cleared by setting the ON bit to 0." name="" value="0x1" />
         <value caption="Disable output of HLVD Comparator (default Reset value)." name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLEVT">
         <value caption="Indicates HLVD Event is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
