Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="First Capture Edge Select bit" name="IC16CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC16CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC16CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02907" name="INT" version="3">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge Polarity Control bit" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge Polarity Control bit" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge Polarity Control bit" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge Polarity Control bit" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge Polarity Control bit" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield mask="0xFF000000" name="NMIKEY" />
         </register>
         <register caption="Priority shadow select register" name="PRISS" offset="0x10" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits" mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS" />
            <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits" mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS" />
            <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits" mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS" />
            <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits" mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS" />
            <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits" mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits" mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits" mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS" />
         </register>
         <register caption="Interrupt status register" name="INTSTAT" offset="0x20" rw="R" size="4">
            <bitfield mask="0x000000FF" name="SIRQ" />
            <bitfield mask="0x00000700" name="SRIPL" />
         </register>
         <register caption="Interrupt proximity timer register" name="IPTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="Interrupt flag status register" name="IFS0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1EIF" />
            <bitfield mask="0x00000040" name="IC1IF" />
            <bitfield mask="0x00000080" name="OC1IF" />
            <bitfield mask="0x00000100" name="INT1IF" />
            <bitfield mask="0x00000200" name="T2IF" />
            <bitfield mask="0x00000400" name="IC2EIF" />
            <bitfield mask="0x00000800" name="IC2IF" />
            <bitfield mask="0x00001000" name="OC2IF" />
            <bitfield mask="0x00002000" name="INT2IF" />
            <bitfield mask="0x00004000" name="T3IF" />
            <bitfield mask="0x00008000" name="IC3EIF" />
            <bitfield mask="0x00010000" name="IC3IF" />
            <bitfield mask="0x00020000" name="OC3IF" />
            <bitfield mask="0x00040000" name="INT3IF" />
            <bitfield mask="0x00080000" name="T4IF" />
            <bitfield mask="0x00100000" name="IC4EIF" />
            <bitfield mask="0x00200000" name="IC4IF" />
            <bitfield mask="0x00400000" name="OC4IF" />
            <bitfield mask="0x00800000" name="INT4IF" />
            <bitfield mask="0x01000000" name="T5IF" />
            <bitfield mask="0x02000000" name="IC5EIF" />
            <bitfield mask="0x04000000" name="IC5IF" />
            <bitfield mask="0x08000000" name="OC5IF" />
            <bitfield mask="0x40000000" name="RTCCIF" />
            <bitfield mask="0x80000000" name="FCEIF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IF" />
            <bitfield mask="0x00000002" name="CMP2IF" />
            <bitfield mask="0x00000004" name="USB1IF" />
            <bitfield mask="0x00000008" name="SPI1EIF" />
            <bitfield mask="0x00000010" name="SPI1RXIF" />
            <bitfield mask="0x00000020" name="SPI1TXIF" />
            <bitfield mask="0x00000040" name="U1EIF" />
            <bitfield mask="0x00000080" name="U1RXIF" />
            <bitfield mask="0x00000100" name="U1TXIF" />
            <bitfield mask="0x00000200" name="I2C1BIF" />
            <bitfield mask="0x00000400" name="I2C1SIF" />
            <bitfield mask="0x00000800" name="I2C1MIF" />
            <bitfield mask="0x00001000" name="CNAIF" />
            <bitfield mask="0x00002000" name="CNBIF" />
            <bitfield mask="0x00004000" name="CNCIF" />
            <bitfield mask="0x00008000" name="CNDIF" />
            <bitfield mask="0x00010000" name="CNEIF" />
            <bitfield mask="0x00020000" name="CNFIF" />
            <bitfield mask="0x00040000" name="CNGIF" />
            <bitfield mask="0x00080000" name="PMPIF" />
            <bitfield mask="0x00100000" name="PMPEIF" />
            <bitfield mask="0x00200000" name="SPI2EIF" />
            <bitfield mask="0x00400000" name="SPI2RXIF" />
            <bitfield mask="0x00800000" name="SPI2TXIF" />
            <bitfield mask="0x01000000" name="U2EIF" />
            <bitfield mask="0x02000000" name="U2RXIF" />
            <bitfield mask="0x04000000" name="U2TXIF" />
            <bitfield mask="0x08000000" name="I2C2BIF" />
            <bitfield mask="0x10000000" name="I2C2SIF" />
            <bitfield mask="0x20000000" name="I2C2MIF" />
            <bitfield mask="0x40000000" name="U3EIF" />
            <bitfield mask="0x80000000" name="U3RXIF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIF" />
            <bitfield mask="0x00000002" name="U4EIF" />
            <bitfield mask="0x00000004" name="U4RXIF" />
            <bitfield mask="0x00000008" name="U4TXIF" />
            <bitfield mask="0x00000010" name="U5EIF" />
            <bitfield mask="0x00000020" name="U5RXIF" />
            <bitfield mask="0x00000040" name="U5TXIF" />
            <bitfield mask="0x00000080" name="CTMUIF" />
            <bitfield mask="0x00000100" name="DMA0IF" />
            <bitfield mask="0x00000200" name="DMA1IF" />
            <bitfield mask="0x00000400" name="DMA2IF" />
            <bitfield mask="0x00000800" name="DMA3IF" />
            <bitfield mask="0x00001000" name="T6IF" />
            <bitfield mask="0x00002000" name="IC6EIF" />
            <bitfield mask="0x00004000" name="IC6IF" />
            <bitfield mask="0x00008000" name="OC6IF" />
            <bitfield mask="0x00010000" name="T7IF" />
            <bitfield mask="0x00020000" name="IC7EIF" />
            <bitfield mask="0x00040000" name="IC7IF" />
            <bitfield mask="0x00080000" name="OC7IF" />
            <bitfield mask="0x00100000" name="T8IF" />
            <bitfield mask="0x00200000" name="IC8EIF" />
            <bitfield mask="0x00400000" name="IC8IF" />
            <bitfield mask="0x00800000" name="OC8IF" />
            <bitfield mask="0x01000000" name="T9IF" />
            <bitfield mask="0x02000000" name="IC9EIF" />
            <bitfield mask="0x04000000" name="IC9IF" />
            <bitfield mask="0x08000000" name="OC9IF" />
            <bitfield mask="0x10000000" name="AD1IF" />
            <bitfield mask="0x40000000" name="AD1DC1IF" />
            <bitfield mask="0x80000000" name="AD1DC2IF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IF" />
            <bitfield mask="0x00000002" name="AD1DF2IF" />
            <bitfield mask="0x00000004" name="AD1DF3IF" />
            <bitfield mask="0x00000008" name="AD1DF4IF" />
            <bitfield mask="0x00000010" name="AD1FIIF" />
            <bitfield mask="0x00000020" name="AD1EOSIF" />
            <bitfield mask="0x00000040" name="AD1ARIF" />
            <bitfield mask="0x00000080" name="AD1RSIF" />
            <bitfield mask="0x00000100" name="AD1FCBTIF" />
            <bitfield mask="0x00000200" name="AD1GIF" />
            <bitfield mask="0x00000400" name="AD1D0IF" />
            <bitfield mask="0x00000800" name="AD1D1IF" />
            <bitfield mask="0x00001000" name="AD1D2IF" />
            <bitfield mask="0x00002000" name="AD1D3IF" />
            <bitfield mask="0x00004000" name="AD1D4IF" />
            <bitfield mask="0x00008000" name="AD1D5IF" />
            <bitfield mask="0x00010000" name="AD1D6IF" />
            <bitfield mask="0x00020000" name="AD1D7IF" />
            <bitfield mask="0x00040000" name="AD1D8IF" />
            <bitfield mask="0x00080000" name="AD1D9IF" />
            <bitfield mask="0x00100000" name="AD1D10IF" />
            <bitfield mask="0x00200000" name="AD1D11IF" />
            <bitfield mask="0x00400000" name="AD1D12IF" />
            <bitfield mask="0x00800000" name="AD1D13IF" />
            <bitfield mask="0x01000000" name="AD1D14IF" />
            <bitfield mask="0x02000000" name="AD1D15IF" />
            <bitfield mask="0x04000000" name="AD1D16IF" />
            <bitfield mask="0x08000000" name="AD1D17IF" />
            <bitfield mask="0x10000000" name="AD1D18IF" />
            <bitfield mask="0x20000000" name="AD1D19IF" />
            <bitfield mask="0x40000000" name="AD1D20IF" />
            <bitfield mask="0x80000000" name="AD1D21IF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS4" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1D22IF" />
            <bitfield mask="0x00000002" name="AD1D23IF" />
            <bitfield mask="0x00000004" name="AD1D24IF" />
            <bitfield mask="0x00000008" name="AD1D25IF" />
            <bitfield mask="0x00000010" name="AD1D26IF" />
            <bitfield mask="0x00000020" name="AD1D27IF" />
            <bitfield mask="0x00000800" name="AD1D33IF" />
            <bitfield mask="0x00001000" name="AD1D34IF" />
            <bitfield mask="0x00002000" name="AD1D35IF" />
            <bitfield mask="0x00004000" name="AD1D36IF" />
            <bitfield mask="0x00008000" name="AD1D37IF" />
            <bitfield mask="0x00010000" name="AD1D38IF" />
            <bitfield mask="0x00020000" name="AD1D39IF" />
            <bitfield mask="0x00040000" name="AD1D40IF" />
            <bitfield mask="0x00080000" name="AD1D41IF" />
            <bitfield mask="0x00800000" name="AD1D45IF" />
            <bitfield mask="0x01000000" name="AD1D46IF" />
            <bitfield mask="0x02000000" name="AD1D47IF" />
            <bitfield mask="0x04000000" name="AD1D48IF" />
            <bitfield mask="0x08000000" name="AD1D49IF" />
            <bitfield mask="0x10000000" name="AD1D50IF" />
            <bitfield mask="0x20000000" name="AD1D51IF" />
            <bitfield mask="0x40000000" name="AD1D52IF" />
            <bitfield mask="0x80000000" name="AD1D53IF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS5" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IF" />
            <bitfield mask="0x00000002" name="CMP4IF" />
            <bitfield mask="0x00000004" name="CMP5IF" />
            <bitfield mask="0x00000010" name="U6EIF" />
            <bitfield mask="0x00000020" name="U6RXIF" />
            <bitfield mask="0x00000040" name="U6TXIF" />
            <bitfield mask="0x00000080" name="CAN1IF" />
            <bitfield mask="0x00000100" name="CAN2IF" />
            <bitfield mask="0x00000200" name="QEI1IF" />
            <bitfield mask="0x00000400" name="QEI2IF" />
            <bitfield mask="0x00000800" name="PWMPEVTIF" />
            <bitfield mask="0x00001000" name="PWMSEVTIF" />
            <bitfield mask="0x00002000" name="PWM1IF" />
            <bitfield mask="0x00004000" name="PWM2IF" />
            <bitfield mask="0x00008000" name="PWM3IF" />
            <bitfield mask="0x00010000" name="PWM4IF" />
            <bitfield mask="0x00020000" name="PWM5IF" />
            <bitfield mask="0x00040000" name="PWM6IF" />
            <bitfield mask="0x00080000" name="I2C3BIF" />
            <bitfield mask="0x00100000" name="I2C3SIF" />
            <bitfield mask="0x00200000" name="I2C3MIF" />
            <bitfield mask="0x00400000" name="DMA4IF" />
            <bitfield mask="0x00800000" name="DMA5IF" />
            <bitfield mask="0x01000000" name="DMA6IF" />
            <bitfield mask="0x02000000" name="DMA7IF" />
            <bitfield mask="0x04000000" name="DATAEEIF" />
            <bitfield mask="0x08000000" name="CAN3IF" />
            <bitfield mask="0x10000000" name="CAN4IF" />
            <bitfield mask="0x20000000" name="QEI3IF" />
            <bitfield mask="0x40000000" name="QEI4IF" />
            <bitfield mask="0x80000000" name="QEI5IF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS6" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="QEI6IF" />
            <bitfield mask="0x00000004" name="I2C4BIF" />
            <bitfield mask="0x00000008" name="I2C4SIF" />
            <bitfield mask="0x00000010" name="I2C4MIF" />
            <bitfield mask="0x00000020" name="IC10EIF" />
            <bitfield mask="0x00000040" name="IC10IF" />
            <bitfield mask="0x00000080" name="OC10IF" />
            <bitfield mask="0x00000100" name="IC11EIF" />
            <bitfield mask="0x00000200" name="IC11IF" />
            <bitfield mask="0x00000400" name="OC11IF" />
            <bitfield mask="0x00000800" name="IC12EIF" />
            <bitfield mask="0x00001000" name="IC12IF" />
            <bitfield mask="0x00002000" name="OC12IF" />
            <bitfield mask="0x00004000" name="IC13EIF" />
            <bitfield mask="0x00008000" name="IC13IF" />
            <bitfield mask="0x00010000" name="OC13IF" />
            <bitfield mask="0x00020000" name="IC14EIF" />
            <bitfield mask="0x00040000" name="IC14IF" />
            <bitfield mask="0x00080000" name="OC14IF" />
            <bitfield mask="0x00100000" name="IC15EIF" />
            <bitfield mask="0x00200000" name="IC15IF" />
            <bitfield mask="0x00400000" name="OC15IF" />
            <bitfield mask="0x00800000" name="IC16EIF" />
            <bitfield mask="0x01000000" name="IC16IF" />
            <bitfield mask="0x02000000" name="OC16IF" />
            <bitfield mask="0x04000000" name="SPI3EIF" />
            <bitfield mask="0x08000000" name="SPI3RXIF" />
            <bitfield mask="0x10000000" name="SPI3TXIF" />
            <bitfield mask="0x20000000" name="SPI4EIF" />
            <bitfield mask="0x40000000" name="SPI4RXIF" />
            <bitfield mask="0x80000000" name="SPI4TXIF" />
         </register>
         <register caption="Interrupt flag status register" name="IFS7" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SPI5EIF" />
            <bitfield mask="0x00000002" name="SPI5RXIF" />
            <bitfield mask="0x00000004" name="SPI5TXIF" />
            <bitfield mask="0x00000008" name="SPI6EIF" />
            <bitfield mask="0x00000010" name="SPI6RXIF" />
            <bitfield mask="0x00000020" name="SPI6TXIF" />
            <bitfield mask="0x00000040" name="SBIF" />
            <bitfield mask="0x00004000" name="PWM7IF" />
            <bitfield mask="0x00008000" name="PWM8IF" />
            <bitfield mask="0x00010000" name="PWM9IF" />
            <bitfield mask="0x00020000" name="PWM10IF" />
            <bitfield mask="0x00040000" name="PWM11IF" />
            <bitfield mask="0x00080000" name="PWM12IF" />
            <bitfield mask="0x00100000" name="USB2IF" />
            <bitfield mask="0x00200000" name="AD1DC3IF" />
            <bitfield mask="0x00400000" name="AD1DC4IF" />
            <bitfield mask="0x00800000" name="PCACHEIF" />
            <bitfield mask="0x40000000" name="CPCIF" />
            <bitfield mask="0x80000000" name="CFDCIF" />
         </register>
         <register caption="Interrupt enable control register" name="IEC0" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1EIE" />
            <bitfield mask="0x00000040" name="IC1IE" />
            <bitfield mask="0x00000080" name="OC1IE" />
            <bitfield mask="0x00000100" name="INT1IE" />
            <bitfield mask="0x00000200" name="T2IE" />
            <bitfield mask="0x00000400" name="IC2EIE" />
            <bitfield mask="0x00000800" name="IC2IE" />
            <bitfield mask="0x00001000" name="OC2IE" />
            <bitfield mask="0x00002000" name="INT2IE" />
            <bitfield mask="0x00004000" name="T3IE" />
            <bitfield mask="0x00008000" name="IC3EIE" />
            <bitfield mask="0x00010000" name="IC3IE" />
            <bitfield mask="0x00020000" name="OC3IE" />
            <bitfield mask="0x00040000" name="INT3IE" />
            <bitfield mask="0x00080000" name="T4IE" />
            <bitfield mask="0x00100000" name="IC4EIE" />
            <bitfield mask="0x00200000" name="IC4IE" />
            <bitfield mask="0x00400000" name="OC4IE" />
            <bitfield mask="0x00800000" name="INT4IE" />
            <bitfield mask="0x01000000" name="T5IE" />
            <bitfield mask="0x02000000" name="IC5EIE" />
            <bitfield mask="0x04000000" name="IC5IE" />
            <bitfield mask="0x08000000" name="OC5IE" />
            <bitfield mask="0x40000000" name="RTCCIE" />
            <bitfield mask="0x80000000" name="FCEIE" />
         </register>
