Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="Interrupt enable control register" name="IEC1" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IE" />
            <bitfield mask="0x00000002" name="CMP2IE" />
            <bitfield mask="0x00000004" name="USB1IE" />
            <bitfield mask="0x00000008" name="SPI1EIE" />
            <bitfield mask="0x00000010" name="SPI1RXIE" />
            <bitfield mask="0x00000020" name="SPI1TXIE" />
            <bitfield mask="0x00000040" name="U1EIE" />
            <bitfield mask="0x00000080" name="U1RXIE" />
            <bitfield mask="0x00000100" name="U1TXIE" />
            <bitfield mask="0x00000200" name="I2C1BIE" />
            <bitfield mask="0x00000400" name="I2C1SIE" />
            <bitfield mask="0x00000800" name="I2C1MIE" />
            <bitfield mask="0x00001000" name="CNAIE" />
            <bitfield mask="0x00002000" name="CNBIE" />
            <bitfield mask="0x00004000" name="CNCIE" />
            <bitfield mask="0x00008000" name="CNDIE" />
            <bitfield mask="0x00010000" name="CNEIE" />
            <bitfield mask="0x00020000" name="CNFIE" />
            <bitfield mask="0x00040000" name="CNGIE" />
            <bitfield mask="0x00080000" name="PMPIE" />
            <bitfield mask="0x00100000" name="PMPEIE" />
            <bitfield mask="0x00200000" name="SPI2EIE" />
            <bitfield mask="0x00400000" name="SPI2RXIE" />
            <bitfield mask="0x00800000" name="SPI2TXIE" />
            <bitfield mask="0x01000000" name="U2EIE" />
            <bitfield mask="0x02000000" name="U2RXIE" />
            <bitfield mask="0x04000000" name="U2TXIE" />
            <bitfield mask="0x08000000" name="I2C2BIE" />
            <bitfield mask="0x10000000" name="I2C2SIE" />
            <bitfield mask="0x20000000" name="I2C2MIE" />
            <bitfield mask="0x40000000" name="U3EIE" />
            <bitfield mask="0x80000000" name="U3RXIE" />
         </register>
         <register caption="Interrupt enable control register" name="IEC2" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIE" />
            <bitfield mask="0x00000002" name="U4EIE" />
            <bitfield mask="0x00000004" name="U4RXIE" />
            <bitfield mask="0x00000008" name="U4TXIE" />
            <bitfield mask="0x00000010" name="U5EIE" />
            <bitfield mask="0x00000020" name="U5RXIE" />
            <bitfield mask="0x00000040" name="U5TXIE" />
            <bitfield mask="0x00000080" name="CTMUIE" />
            <bitfield mask="0x00000100" name="DMA0IE" />
            <bitfield mask="0x00000200" name="DMA1IE" />
            <bitfield mask="0x00000400" name="DMA2IE" />
            <bitfield mask="0x00000800" name="DMA3IE" />
            <bitfield mask="0x00001000" name="T6IE" />
            <bitfield mask="0x00002000" name="IC6EIE" />
            <bitfield mask="0x00004000" name="IC6IE" />
            <bitfield mask="0x00008000" name="OC6IE" />
            <bitfield mask="0x00010000" name="T7IE" />
            <bitfield mask="0x00020000" name="IC7EIE" />
            <bitfield mask="0x00040000" name="IC7IE" />
            <bitfield mask="0x00080000" name="OC7IE" />
            <bitfield mask="0x00100000" name="T8IE" />
            <bitfield mask="0x00200000" name="IC8EIE" />
            <bitfield mask="0x00400000" name="IC8IE" />
            <bitfield mask="0x00800000" name="OC8IE" />
            <bitfield mask="0x01000000" name="T9IE" />
            <bitfield mask="0x02000000" name="IC9EIE" />
            <bitfield mask="0x04000000" name="IC9IE" />
            <bitfield mask="0x08000000" name="OC9IE" />
            <bitfield mask="0x10000000" name="AD1IE" />
            <bitfield mask="0x40000000" name="AD1DC1IE" />
            <bitfield mask="0x80000000" name="AD1DC2IE" />
         </register>
         <register caption="Interrupt enable control register" name="IEC3" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IE" />
            <bitfield mask="0x00000002" name="AD1DF2IE" />
            <bitfield mask="0x00000004" name="AD1DF3IE" />
            <bitfield mask="0x00000008" name="AD1DF4IE" />
            <bitfield mask="0x00000010" name="AD1FIIE" />
            <bitfield mask="0x00000020" name="AD1EOSIE" />
            <bitfield mask="0x00000040" name="AD1ARIE" />
            <bitfield mask="0x00000080" name="AD1RSIE" />
            <bitfield mask="0x00000100" name="AD1FCBTIE" />
            <bitfield mask="0x00000200" name="AD1GIE" />
            <bitfield mask="0x00000400" name="AD1D0IE" />
            <bitfield mask="0x00000800" name="AD1D1IE" />
            <bitfield mask="0x00001000" name="AD1D2IE" />
            <bitfield mask="0x00002000" name="AD1D3IE" />
            <bitfield mask="0x00004000" name="AD1D4IE" />
            <bitfield mask="0x00008000" name="AD1D5IE" />
            <bitfield mask="0x00010000" name="AD1D6IE" />
            <bitfield mask="0x00020000" name="AD1D7IE" />
            <bitfield mask="0x00040000" name="AD1D8IE" />
            <bitfield mask="0x00080000" name="AD1D9IE" />
            <bitfield mask="0x00100000" name="AD1D10IE" />
            <bitfield mask="0x00200000" name="AD1D11IE" />
            <bitfield mask="0x00400000" name="AD1D12IE" />
            <bitfield mask="0x00800000" name="AD1D13IE" />
            <bitfield mask="0x01000000" name="AD1D14IE" />
            <bitfield mask="0x02000000" name="AD1D15IE" />
            <bitfield mask="0x04000000" name="AD1D16IE" />
            <bitfield mask="0x08000000" name="AD1D17IE" />
            <bitfield mask="0x10000000" name="AD1D18IE" />
            <bitfield mask="0x20000000" name="AD1D19IE" />
            <bitfield mask="0x40000000" name="AD1D20IE" />
            <bitfield mask="0x80000000" name="AD1D21IE" />
         </register>
         <register caption="Interrupt enable control register" name="IEC4" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1D22IE" />
            <bitfield mask="0x00000002" name="AD1D23IE" />
            <bitfield mask="0x00000004" name="AD1D24IE" />
            <bitfield mask="0x00000008" name="AD1D25IE" />
            <bitfield mask="0x00000010" name="AD1D26IE" />
            <bitfield mask="0x00000020" name="AD1D27IE" />
            <bitfield mask="0x00000800" name="AD1D33IE" />
            <bitfield mask="0x00001000" name="AD1D34IE" />
            <bitfield mask="0x00002000" name="AD1D35IE" />
            <bitfield mask="0x00004000" name="AD1D36IE" />
            <bitfield mask="0x00008000" name="AD1D37IE" />
            <bitfield mask="0x00010000" name="AD1D38IE" />
            <bitfield mask="0x00020000" name="AD1D39IE" />
            <bitfield mask="0x00040000" name="AD1D40IE" />
            <bitfield mask="0x00080000" name="AD1D41IE" />
            <bitfield mask="0x00800000" name="AD1D45IE" />
            <bitfield mask="0x01000000" name="AD1D46IE" />
            <bitfield mask="0x02000000" name="AD1D47IE" />
            <bitfield mask="0x04000000" name="AD1D48IE" />
            <bitfield mask="0x08000000" name="AD1D49IE" />
            <bitfield mask="0x10000000" name="AD1D50IE" />
            <bitfield mask="0x20000000" name="AD1D51IE" />
            <bitfield mask="0x40000000" name="AD1D52IE" />
            <bitfield mask="0x80000000" name="AD1D53IE" />
         </register>
         <register caption="Interrupt enable control register" name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IE" />
            <bitfield mask="0x00000002" name="CMP4IE" />
            <bitfield mask="0x00000004" name="CMP5IE" />
            <bitfield mask="0x00000010" name="U6EIE" />
            <bitfield mask="0x00000020" name="U6RXIE" />
            <bitfield mask="0x00000040" name="U6TXIE" />
            <bitfield mask="0x00000080" name="CAN1IE" />
            <bitfield mask="0x00000100" name="CAN2IE" />
            <bitfield mask="0x00000200" name="QEI1IE" />
            <bitfield mask="0x00000400" name="QEI2IE" />
            <bitfield mask="0x00000800" name="PWMPEVTIE" />
            <bitfield mask="0x00001000" name="PWMSEVTIE" />
            <bitfield mask="0x00002000" name="PWM1IE" />
            <bitfield mask="0x00004000" name="PWM2IE" />
            <bitfield mask="0x00008000" name="PWM3IE" />
            <bitfield mask="0x00010000" name="PWM4IE" />
            <bitfield mask="0x00020000" name="PWM5IE" />
            <bitfield mask="0x00040000" name="PWM6IE" />
            <bitfield mask="0x00080000" name="I2C3BIE" />
            <bitfield mask="0x00100000" name="I2C3SIE" />
            <bitfield mask="0x00200000" name="I2C3MIE" />
            <bitfield mask="0x00400000" name="DMA4IE" />
            <bitfield mask="0x00800000" name="DMA5IE" />
            <bitfield mask="0x01000000" name="DMA6IE" />
            <bitfield mask="0x02000000" name="DMA7IE" />
            <bitfield mask="0x04000000" name="DATAEEIE" />
            <bitfield mask="0x08000000" name="CAN3IE" />
            <bitfield mask="0x10000000" name="CAN4IE" />
            <bitfield mask="0x20000000" name="QEI3IE" />
            <bitfield mask="0x40000000" name="QEI4IE" />
            <bitfield mask="0x80000000" name="QEI5IE" />
         </register>
