Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="Interrupt priority control register" name="IPC30" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D14IS" />
            <bitfield mask="0x0000001C" name="AD1D14IP" />
            <bitfield mask="0x00000300" name="AD1D15IS" />
            <bitfield mask="0x00001C00" name="AD1D15IP" />
            <bitfield mask="0x00030000" name="AD1D16IS" />
            <bitfield mask="0x001C0000" name="AD1D16IP" />
            <bitfield mask="0x03000000" name="AD1D17IS" />
            <bitfield mask="0x1C000000" name="AD1D17IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC31" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D18IS" />
            <bitfield mask="0x0000001C" name="AD1D18IP" />
            <bitfield mask="0x00000300" name="AD1D19IS" />
            <bitfield mask="0x00001C00" name="AD1D19IP" />
            <bitfield mask="0x00030000" name="AD1D20IS" />
            <bitfield mask="0x001C0000" name="AD1D20IP" />
            <bitfield mask="0x03000000" name="AD1D21IS" />
            <bitfield mask="0x1C000000" name="AD1D21IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC32" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D22IS" />
            <bitfield mask="0x0000001C" name="AD1D22IP" />
            <bitfield mask="0x00000300" name="AD1D23IS" />
            <bitfield mask="0x00001C00" name="AD1D23IP" />
            <bitfield mask="0x00030000" name="AD1D24IS" />
            <bitfield mask="0x001C0000" name="AD1D24IP" />
            <bitfield mask="0x03000000" name="AD1D25IS" />
            <bitfield mask="0x1C000000" name="AD1D25IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC33" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D26IS" />
            <bitfield mask="0x0000001C" name="AD1D26IP" />
            <bitfield mask="0x00000300" name="AD1D27IS" />
            <bitfield mask="0x00001C00" name="AD1D27IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC34" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x03000000" name="AD1D33IS" />
            <bitfield mask="0x1C000000" name="AD1D33IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC35" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D34IS" />
            <bitfield mask="0x0000001C" name="AD1D34IP" />
            <bitfield mask="0x00000300" name="AD1D35IS" />
            <bitfield mask="0x00001C00" name="AD1D35IP" />
            <bitfield mask="0x00030000" name="AD1D36IS" />
            <bitfield mask="0x001C0000" name="AD1D36IP" />
            <bitfield mask="0x03000000" name="AD1D37IS" />
            <bitfield mask="0x1C000000" name="AD1D37IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC36" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D38IS" />
            <bitfield mask="0x0000001C" name="AD1D38IP" />
            <bitfield mask="0x00000300" name="AD1D39IS" />
            <bitfield mask="0x00001C00" name="AD1D39IP" />
            <bitfield mask="0x00030000" name="AD1D40IS" />
            <bitfield mask="0x001C0000" name="AD1D40IP" />
            <bitfield mask="0x03000000" name="AD1D41IS" />
            <bitfield mask="0x1C000000" name="AD1D41IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC37" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x03000000" name="AD1D45IS" />
            <bitfield mask="0x1C000000" name="AD1D45IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC38" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D46IS" />
            <bitfield mask="0x0000001C" name="AD1D46IP" />
            <bitfield mask="0x00000300" name="AD1D47IS" />
            <bitfield mask="0x00001C00" name="AD1D47IP" />
            <bitfield mask="0x00030000" name="AD1D48IS" />
            <bitfield mask="0x001C0000" name="AD1D48IP" />
            <bitfield mask="0x03000000" name="AD1D49IS" />
            <bitfield mask="0x1C000000" name="AD1D49IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC39" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D50IS" />
            <bitfield mask="0x0000001C" name="AD1D50IP" />
            <bitfield mask="0x00000300" name="AD1D51IS" />
            <bitfield mask="0x00001C00" name="AD1D51IP" />
            <bitfield mask="0x00030000" name="AD1D52IS" />
            <bitfield mask="0x001C0000" name="AD1D52IP" />
            <bitfield mask="0x03000000" name="AD1D53IS" />
            <bitfield mask="0x1C000000" name="AD1D53IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC40" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP3IS" />
            <bitfield mask="0x0000001C" name="CMP3IP" />
            <bitfield mask="0x00000300" name="CMP4IS" />
            <bitfield mask="0x00001C00" name="CMP4IP" />
            <bitfield mask="0x00030000" name="CMP5IS" />
            <bitfield mask="0x001C0000" name="CMP5IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC41" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U6EIS" />
            <bitfield mask="0x0000001C" name="U6EIP" />
            <bitfield mask="0x00000300" name="U6RXIS" />
            <bitfield mask="0x00001C00" name="U6RXIP" />
            <bitfield mask="0x00030000" name="U6TXIS" />
            <bitfield mask="0x001C0000" name="U6TXIP" />
            <bitfield mask="0x03000000" name="CAN1IS" />
            <bitfield mask="0x1C000000" name="CAN1IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC42" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CAN2IS" />
            <bitfield mask="0x0000001C" name="CAN2IP" />
            <bitfield mask="0x00000300" name="QEI1IS" />
            <bitfield mask="0x00001C00" name="QEI1IP" />
            <bitfield mask="0x00030000" name="QEI2IS" />
            <bitfield mask="0x001C0000" name="QEI2IP" />
            <bitfield mask="0x03000000" name="PWMPEVTIS" />
            <bitfield mask="0x1C000000" name="PWMPEVTIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC43" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWMSEVTIS" />
            <bitfield mask="0x0000001C" name="PWMSEVTIP" />
            <bitfield mask="0x00000300" name="PWM1IS" />
            <bitfield mask="0x00001C00" name="PWM1IP" />
            <bitfield mask="0x00030000" name="PWM2IS" />
            <bitfield mask="0x001C0000" name="PWM2IP" />
            <bitfield mask="0x03000000" name="PWM3IS" />
            <bitfield mask="0x1C000000" name="PWM3IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC44" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWM4IS" />
            <bitfield mask="0x0000001C" name="PWM4IP" />
            <bitfield mask="0x00000300" name="PWM5IS" />
            <bitfield mask="0x00001C00" name="PWM5IP" />
            <bitfield mask="0x00030000" name="PWM6IS" />
            <bitfield mask="0x001C0000" name="PWM6IP" />
            <bitfield mask="0x03000000" name="I2C3BIS" />
            <bitfield mask="0x1C000000" name="I2C3BIP" />
         </register>
