Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="Output Compare 'x' Control Register" name="OC5CON" offset="0x4800" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC5CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC5CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC5CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC5CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC5CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC5CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC6CON" offset="0x4A00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC6CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC6CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC6CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC6CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC6CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC6CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC7CON" offset="0x4C00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC7CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC7CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC7CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC7CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC7CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC7CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC8CON" offset="0x4E00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC8CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC8CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC8CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC8CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC8CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC8CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC9CON" offset="0x5000" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC9CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC9CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC9CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC9CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC9CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC9CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC10CON" offset="0x25200" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC10CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC10CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC10CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC10CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC10CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC10CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC11CON" offset="0x25400" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC11CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC11CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC11CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC11CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC11CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC11CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC12CON" offset="0x25600" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC12CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC12CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC12CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC12CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC12CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC12CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC13CON" offset="0x25800" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC13CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC13CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC13CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC13CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC13CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC13CON__ON" />
         </register>
