Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
         <register caption="Output Compare 'x' Control Register" name="OC14CON" offset="0x25A00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC14CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC14CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC14CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC14CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC14CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC14CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC15CON" offset="0x25C00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC15CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC15CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC15CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC15CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC15CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC15CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC16CON" offset="0x25E00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC16CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit(2)" mask="0x00000008" name="OCTSEL" values="OC16CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit(1)" mask="0x00000010" name="OCFLT" values="OC16CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC16CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC16CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC16CON__ON" />
         </register>
         <register caption="" name="OC1R" offset="0x4010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1R" />
         </register>
         <register caption="" name="OC2R" offset="0x4210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2R" />
         </register>
         <register caption="" name="OC3R" offset="0x4410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3R" />
         </register>
         <register caption="" name="OC4R" offset="0x4610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4R" />
         </register>
         <register caption="" name="OC5R" offset="0x4810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5R" />
         </register>
         <register caption="" name="OC6R" offset="0x4A10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6R" />
         </register>
         <register caption="" name="OC7R" offset="0x4C10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7R" />
         </register>
         <register caption="" name="OC8R" offset="0x4E10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8R" />
         </register>
         <register caption="" name="OC9R" offset="0x5010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9R" />
         </register>
         <register caption="" name="OC10R" offset="0x25210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC10R" />
         </register>
         <register caption="" name="OC11R" offset="0x25410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC11R" />
         </register>
         <register caption="" name="OC12R" offset="0x25610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC12R" />
         </register>
         <register caption="" name="OC13R" offset="0x25810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC13R" />
         </register>
         <register caption="" name="OC14R" offset="0x25A10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC14R" />
         </register>
         <register caption="" name="OC15R" offset="0x25C10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC15R" />
         </register>
         <register caption="" name="OC16R" offset="0x25E10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC16R" />
         </register>
         <register caption="" name="OC1RS" offset="0x4020" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1RS" />
         </register>
         <register caption="" name="OC2RS" offset="0x4220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2RS" />
         </register>
         <register caption="" name="OC3RS" offset="0x4420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3RS" />
         </register>
         <register caption="" name="OC4RS" offset="0x4620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4RS" />
         </register>
         <register caption="" name="OC5RS" offset="0x4820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5RS" />
         </register>
         <register caption="" name="OC6RS" offset="0x4A20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6RS" />
         </register>
         <register caption="" name="OC7RS" offset="0x4C20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7RS" />
         </register>
