Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPK100.atdf
      <value-group caption="Requested Region Number bits" name="SBT1ELOG1__REGION">
         <value caption="Target region 15 reported a permission group violation" name="" value="0xf" />
         <value caption="Target region 14 reported a permission group violation" name="" value="0xe" />
         <value caption="Target region 13 reported a permission group violation" name="" value="0xd" />
         <value caption="Target region 12 reported a permission group violation" name="" value="0xc" />
         <value caption="Target region 11 reported a permission group violation" name="" value="0xb" />
         <value caption="Target region 10 reported a permission group violation" name="" value="0xa" />
         <value caption="Target region 9 reported a permission group violation" name="" value="0x9" />
         <value caption="Target region 8 reported a permission group violation" name="" value="0x8" />
         <value caption="Target region 7 reported a permission group violation" name="" value="0x7" />
         <value caption="Target region 6 reported a permission group violation" name="" value="0x6" />
         <value caption="Target region 5 reported a permission group violation" name="" value="0x5" />
         <value caption="Target region 4 reported a permission group violation" name="" value="0x4" />
         <value caption="Target region 3 reported a permission group violation" name="" value="0x3" />
         <value caption="Target region 2 reported a permission group violation" name="" value="0x2" />
         <value caption="Target region 1 reported a permission group violation" name="" value="0x1" />
         <value caption="Target region 0 reported a permission group violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT1ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="CAN4" name="" value="0xd" />
         <value caption="CAN3" name="" value="0xc" />
         <value caption="CAN2" name="" value="0xb" />
         <value caption="CAN1" name="" value="0xa" />
         <value caption="USB2" name="" value="0x9" />
         <value caption="USB1" name="" value="0x8" />
         <value caption="ADC0-ADC5, ADC7" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Flash Controller" name="" value="0x5" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3" />
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2" />
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Code bits" name="SBT1ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Permission violation" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT1ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT2ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT2ELOG1__REGION">
         <value caption="Target region 15 reported a permission group violation" name="" value="0xf" />
         <value caption="Target region 14 reported a permission group violation" name="" value="0xe" />
         <value caption="Target region 13 reported a permission group violation" name="" value="0xd" />
         <value caption="Target region 12 reported a permission group violation" name="" value="0xc" />
         <value caption="Target region 11 reported a permission group violation" name="" value="0xb" />
         <value caption="Target region 10 reported a permission group violation" name="" value="0xa" />
         <value caption="Target region 9 reported a permission group violation" name="" value="0x9" />
         <value caption="Target region 8 reported a permission group violation" name="" value="0x8" />
         <value caption="Target region 7 reported a permission group violation" name="" value="0x7" />
         <value caption="Target region 6 reported a permission group violation" name="" value="0x6" />
         <value caption="Target region 5 reported a permission group violation" name="" value="0x5" />
         <value caption="Target region 4 reported a permission group violation" name="" value="0x4" />
         <value caption="Target region 3 reported a permission group violation" name="" value="0x3" />
         <value caption="Target region 2 reported a permission group violation" name="" value="0x2" />
         <value caption="Target region 1 reported a permission group violation" name="" value="0x1" />
         <value caption="Target region 0 reported a permission group violation" name="" value="0x0" />
      </value-group>
